#pragma once

//定数として使うものはConfigにまとめておく（ゲームのルールとして決まっているものを書いている）

//=====================================================
//ゲーム設定
//=====================================================

//目標点(勝利となる点数）
const int TARGET_SCORE = 21;
//バーストになる点数（負けになる点数）
const int BURST_SCORE = 22;
//CPUが自動的にカードを引く上限(15以下ならカードを引く。他にプレイヤーより点数が低い場合もカードを引く）
const int CPU_DRAW_LIMIT = 15;

//=====================================================
//カード設定
//=====================================================

//カードの最小値
const int CARD_MIN = 1;
//カードの最大値
const int CARD_MAX = 11;
//同じ数字のカードの枚数
const int CARD_DUPLICATE_COUNT = 4;
//カード総枚数
const int CARD_TOTAL = 44;

//=====================================================
//初期カード設定
//=====================================================

//最初に配るカード
const int INTTAL_CARD_COUNT = 2;

//=====================================================
//プレイヤー入力
//=====================================================

//カードを引く
const int INPUT_YES = 0;
//カードを引かない
const int INPUT_NO = 1;